In [1]:
#Pandas Dataframe and Series

import pandas as pd

In [ ]:
#Seris

import pandas as pd

data = [1, 2, 3, 4, 5]

series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64
[1, 2, 3, 4, 5]

In [4]:
#Create a series usinng dictionary

data = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}

series = pd.Series(data)
print(series)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
data = [10, 20, 30, 40, 50]
Myindex = ['a', 'b', 'c', 'd', 'e']

series = pd.Series(data, index=Myindex) 
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [ ]:
#DataFrame

#Create a DataFrame from a dictionary
data = {
    'Name' : ['Alice', 'Bob', 'Charlie'],
    'Age' : [25, 30, 35],
    'City' : ['New York', 'Los Angeles', 'Chicago']
}

dataframe = pd.DataFrame(data)
print(dataframe)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [15]:
#Creating a DataFrame from a list of dictionaries

data = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
    {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'}
]

dataframe = pd.DataFrame(data)
print(dataframe)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [24]:
#Reading a CSV file into a DataFrame

df = pd.read_csv('Details.csv')
# print(df)

print(df.head(4))  # Display the first few rows of the DataFrame

  Order ID  Amount  Profit  Quantity     Category      Sub-Category  \
0  B-25681    1096     658         7  Electronics  Electronic Games
1  B-26055    5729      64        14    Furniture            Chairs
2  B-25955    2927     146         8    Furniture         Bookcases
3  B-26093    2847     712         8  Electronics          Printers

   PaymentMode
0          COD
1          EMI
2          EMI
3  Credit Card

In [25]:
#Accessing DataFrame columns
data = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
    {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'}
]

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [30]:
df.loc[0][1]

C:\Users\Asus\AppData\Local\Temp\ipykernel_26296\395987507.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][1]

np.int64(25)

In [37]:
#Accessing specific elements in a DataFrame

df.at[2, 'Age']  # Accessing the 'Age' of the second row
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [45]:
#Data manipulation

df['Salary'] = [50000, 60000, 70000]  # Adding a new column
print(df)

df.drop('Salary', axis=1, inplace=True)  # Dropping a column
print(df)

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [ ]:
#Add age to the column
df['Age'] = df['Age'] + 1